{
  "level":[
    {
      "qna":[
        {
          "quest":"Aku adalah bangun yang mempunyai 3 sisi.",
          "ans":"triangle"
        },
        {
          "quest":"Aku adalah bangun datar 4 sisi, yang mana sisi yang saling berhadapan sama panjang dan sejajar. Namun aku tidak memiliki sudut yang besarnya 90 derajat.",
          "ans":"parallelogram"
        },
        {
          "quest":"Aku adalah bangun datar 4 sisi yang memiliki satu simetri lipat dan satu simetri putar",
          "ans":"trapezoid"
        },
        {
          "quest":"Aku adalah bangun datar 4 sisi yang memiliki dua pasang sisi sama panjang yang tidak sejajar.",
          "ans":"kite"
        },
        {
          "quest":"Aku tidak mempunyai sisi berbentuk garis lurus.",
          "ans":"circle"
        },
        {
          "quest":"Aku mempunyai sudut siku-siku, jumlah sisi ada 4, dan semuanya sama panjang.",
          "ans":"square"
        },
        {
          "quest":"Aku adalah bangun datar yang jumlah sudutnya sebesar 180 derajat.",
          "ans":"triangle"
        },
        {
          "quest":"Jumlah sumbu simetri lipatku tak berhingga banyaknya.",
          "ans":"circle"
        },
        {
          "quest":"Aku adalah bangun datar 4 sisi yang tidak memiliki sumbu simetri lipat",
          "ans":"parallelogram"
        },
        {
          "quest":"Aku memiliki 4 sumbu simetri lipat.",
          "ans":"square"
        },
        {
          "quest":"Aku adalah bangun datar 4 sisi yang hanya memiliki 1 sumbu simetri lipat",
          "ans":"trapezoid"
        },
        {
          "quest":"Aku adalah gabungan dari segiempat dan segitiga siku-siku",
          "ans":"trapezoid"
        },
        {
          "quest":"Aku adalah gabungan dari 2 segitiga sama kaki",
          "ans":"kite"
        },
        {
          "quest":"Aku adalah bangun datar yang mana jarak antara titik pusat ke sisi-sisiku selalu sama panjang.",
          "ans":"circle"
        },
        {
          "quest":"Jika aku diputar-putar, maka bentukku akan selalu sama seperti semula.",
          "ans":"circle"
        }
      ]
    },
    {
      "qna":[
        {
          "quest":"Besar keliling aku sama dengan empat kali sisiku.",
          "ans":"square"
        },
        {
          "quest":"Kelilingku adalah 3 kali sisiku",
          "ans":"triangle"
        },
        {
          "quest":"Kelilingku adalah phi dikali dengan panjang diameterku",
          "ans":"circle"
        },
        {
          "quest":"Manakah yang lebih besar antara keliling lingkaran berjari-jari 10 cm atau persegi dengan sisi 10 cm?",
          "ans":"circle"
        },
        {
          "quest":"Manakah yang lebih besar antara keliling lingkaran berjari-jari 10 cm atau segitiga sama sisi dengan sisi 10 cm?",
          "ans":"circle"
        },
        {
          "quest":"Manakah yang kelilingnya paling besar antara segitiga dengan persegi jika panjang sisi-sisinya sama?",
          "ans":"square"
        },
        {
          "quest":"Manakah yang kelilingnya paling besar antara persegi dengan segitiga jika panjang sisi segitiga sama sisi 2 kalinya panjang sisi persegi",
          "ans":"triangle"
        },
        {
          "quest":"Manakah yang kelilingnya paling besar antara lingkaran dengan segitiga sama sisi jika panjang sisi segitiga sama dengan panjang diameter lingkaran?",
          "ans":"circle"
        },
        {
          "quest":"Manakah yang memiliki keliling paling besar antara segitiga dengan sisi 7 cm dan persegi dengan sisi 5 cm?",
          "ans":"triangle"
        },
        {
          "quest":"Manakah yang memiliki keliling paling besar antara persegi dengan sisi 10 cm dan lingkaran dengan jari-jari 7 cm?",
          "ans":"circle"
        }
      ]
    },
    {
      "qna":[
        {
          "quest":"Besar luasku sama dengan setengah dari perkalian diagonal-diagonalku.",
          "ans":"kite"
        },
        {
          "quest":"Besar luasku adalah setengah dari perkalian antara alas dengan tinggi.",
          "ans":"triangle"
        },
        {
          "quest":"Besar luasku adalah 2 kalinya luas segitiga yang membentukku",
          "ans":"parallelogram"
        },
        {
          "quest":"Untuk mencari luasku, kamu membutuhkan nilai phi.",
          "ans":"circle"
        },
        {
          "quest":"Besar luasku bisa dicari dengan menggabungkan rumus segitiga dan persegi panjang",
          "ans":"trapezoid"
        },
        {
          "quest":"Manakah yang lebih besar antara luas persegi atau luas segitiga jika diketahui alas dan tinggi segitiga sama dengan panjang sisi persegi?",
          "ans":"square"
        },
        {
          "quest":"Manakah yang lebih besar antara luas persegi atau luas lingkaran jika diketahui sisi persegi sama dengan jari-jari lingkaran?",
          "ans":"circle"
        },
        {
          "quest":"Manakah yang lebih besar antara luas jajargenjang atau luas layang-layang jika diketahui alas dan tinggi jajargenjang berturut-turut sama dengan diagonal satu dan dua layang-layang?",
          "ans":"parallelogram"
        },
        {
          "quest":"Budi dan Siti masing-masing memiliki seutas tali dengan panjang 44 cm. Dengan tali tersebut, Budi ingin membentuknya menjadi bangun persegi dan Siti inngin membentuknya menjadi lingkaran. Dari kedua bangun datar tersebut, mana yang memiliki luas paling besar?",
          "ans":"circle"
        },
        {
          "quest":"Budi memiliki tali dengan bentuk persegi, sedangkan Andi memiliki tali dengan bentuk lingkaran. Kedua bangun datar tesebut memiliki luas yang sama, yaitu 154 cm^2. Jika tali tersebut dibentangkan, tali dengan bentuk bangun datar apa yang paling panjang?",
          "ans":"square"
        }
      ]
    }
  ]
}