{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_27_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "filters": 8, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_26", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_27", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_28", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_29", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_40", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_41", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_42", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_43", "trainable": true, "dtype": "float32", "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "acc", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_27/kernel", "shape": [5, 5, 3, 8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4108465636477751, "scale": 0.0025205310653237736, "original_dtype": "float32"}}, {"name": "conv2d_27/bias", "shape": [8], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00064850406031873, "scale": 0.00064850406031873, "original_dtype": "float32"}}, {"name": "conv2d_28/kernel", "shape": [5, 5, 8, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.44557349120869355, "scale": 0.00316009568233116, "original_dtype": "float32"}}, {"name": "conv2d_28/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10113318264484406, "scale": 0.00038369198457575314, "original_dtype": "float32"}}, {"name": "conv2d_29/kernel", "shape": [5, 5, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5752051851328681, "scale": 0.0036176426737916235, "original_dtype": "float32"}}, {"name": "conv2d_29/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12253259867429733, "scale": 0.00046472690232536373, "original_dtype": "float32"}}, {"name": "conv2d_30/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.665413337945938, "scale": 0.004238301515579223, "original_dtype": "float32"}}, {"name": "conv2d_30/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10151911215747104, "scale": 0.0005936790184647429, "original_dtype": "float32"}}, {"name": "dense_39/kernel", "shape": [7744, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5908508230658138, "scale": 0.004376672763450473, "original_dtype": "float32"}}, {"name": "dense_39/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17975171290191952, "scale": 0.0011027712447970522, "original_dtype": "float32"}}, {"name": "dense_40/kernel", "shape": [128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5426771872183855, "scale": 0.003716967035742367, "original_dtype": "float32"}}, {"name": "dense_40/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3543622374534607, "scale": 0.003192452589670817, "original_dtype": "float32"}}, {"name": "dense_41/kernel", "shape": [64, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.589399934983721, "scale": 0.004431578458524218, "original_dtype": "float32"}}, {"name": "dense_41/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1378553892467536, "scale": 0.0025064616226682475, "original_dtype": "float32"}}, {"name": "dense_42/kernel", "shape": [32, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5431544705933216, "scale": 0.004603003988078996, "original_dtype": "float32"}}, {"name": "dense_42/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23273790005375355, "scale": 0.0028733074080710317, "original_dtype": "float32"}}, {"name": "dense_43/kernel", "shape": [16, 6], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6770916302998861, "scale": 0.004978614928675633, "original_dtype": "float32"}}, {"name": "dense_43/bias", "shape": [6], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5262228647867838, "scale": 0.003288892904917399, "original_dtype": "float32"}}]}]}